Revit 2026 API

# FamilyInstanceSuperComponent Property

---

Property to get the super component of current family instance.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Element SuperComponent { get; }
```
```vb
Public ReadOnly Property SuperComponent As Element
	Get
```
```cpp
public:
property Element^ SuperComponent {
	Element^ get ();
}
```
```fsharp
member SuperComponent : Element with get
```

#### Property Value

Element

When the FamilyInstance has no super component, it returns

#### Reference

FamilyInstance Class

Autodesk.Revit.DB Namespace